namespace Common.Enum
{
    public enum MessagesType
    {
        موفق = 1,
        هشدار = 2,
        خطر = 3,
        اطلاعات = 4
    }

    public enum MessageEnum
    {
        عملیات_با_موفقیت_انجام_شد = 1,
        خطایی_رخ_داده_است = 2,
        به_دلیل_استفاده_از_این_اطلاعات_حذف_مقدور_نمی_باشد = 3,
        به_دلیل_استفاده_از_این_اطلاعات_ویرایش_مقدور_نمی_باشد = 4,
        مدل_نمی_تواند_خالی_باشد = 5,
        شناسه_مربوطه_نمی_تواند_خالی_باشد = 6,
        فقط_مستر_اسکرام_می_تواند_عملیات_ابطال_را_انجام_دهد = 7,
        قبلا_تغییر_وضعیت_داده_شده_است = 8,
        کاربری_با_این_شماره_تلفن_همراه_یافت_نشد = 9,
        رمز_عبور_اشتباه_وارد_شده_است = 10,
        اکانت_کاربر_غیرفعال_می_باشد = 11,
        ورود_موفق = 12,
        هویت_کاربر_قابل_احراز_نیست = 13,
        ورود_معتبر = 14,
        ورود_نامعتبر = 15,
        مسیر_بارگذاری_فایل_اشتباه_است = 16,
        فایلی_برای_بارگذاری_یافت_نشد = 17,
        تاریخ_شروع_با_سایر_تاریخ_ها_تداخل_زمانی_دارد = 18,
        تاریخ_پایان_با_سایر_تاریخ_ها_تداخل_زمانی_دارد = 19,
        رکورد_مورد_نظر_یافت_نشد = 20,
        ثبت_رکورد_با_مشکل_مواجه_شد = 21,
        حذف_رکورد_با_مشکل_مواجه_شد = 22,
        تاریخ_نیاز_برای_کالای_0_معتبر_نمی_باشد = 23,
        مقدار_کالای_0_نمی_تواند_صفر_باشد = 24,
        کالای_0_تکراری_می_باشد = 25,
        کالایی_ثبت_نشده_است = 26,
        شناسه_آخرین_وضعیت_مقدار_دهی_نشده_است = 27,
        شماره_موبایل_یا_رمز_ورود_اشتباه_است = 28,
        شما_مجاز_به_انجام_این_عملیات_نمی_باشید = 29,
        تاریخ_شروع_یا_تاریخ_پایان_با_سایر_تاریخ_ها_تداخل_زمانی_دارد = 30,
        ماشین_وضعیت_ثبت_نشده_است = 31,
        اینام_موجودیت_ثبت_نشده_است = 32,
        وضعیت_شروع_برای_ماشین_وضعیت_ثبت_نشده_است = 33,
        موجودیت_برای_ایجاد_شماره_پیدا_نشد = 34,
        کد_پرسنلی_اشتباه_است = 35,
        رمز_عبور_اشتباه_است = 36
    }
}
